import { PrismaClient } from "@prisma/client";

const prisma = new PrismaClient();

// const faculties = [
//     "การผังเมืองบัณฑิต",
//     "การออกแบบพัฒนาชุมชนเมืองบัณฑิต (หลักสูตรนานาชาติ)",
//     "การแพทย์แผนจีนบัณฑิต (หลักสูตรนานาชาติ)",
//     "การแพทย์แผนไทยประยุกต์บัณฑิต",
//     "ควบบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการธุรกิจแบบบูรณาการ",
//     "ควบบัญชีบัณฑิต สาขาวิชาการบัญชีธุรกิจแบบบูรณาการ",
//     "ทันตแพทยศาสตรบัณฑิต",
//     "ทันตแพทยศาสตรบัณฑิต (หลักสูตรทวิภาษา)",
//     "นิติศาสตรบัณฑิต สาขาวิชากฎหมายธุรกิจ (หลักสูตรนานาชาติ)",
//     "นิติศาสตร์บัณฑิต",
//     "บริหารธุรกิจบัณฑิต",
//     "บริหารธุรกิจบัณฑิต (หลักสูตรนานาชาติ)",
//     "บัญชีบัณฑิต",
//     "บัญชีบัณฑิต (หลักสูตรนานาชาติ)",
//     "พยาบาลศาสตรบัณฑิต",
//     "พยาบาลศาสตรบัณฑิต (หลักสูตรนานาชาติ)",
//     "ภูมิสถาปัตยกรรมศาสตรบัณฑิต",
//     "รัฐศาสตรบัณฑิต",
//     "รัฐศาสตรบัณฑิต สาขาวิชาการเมืองและการระหว่างประเทศ (ภาคภาษาอังกฤษ)",
//     "วารสารศาสตรบัณฑิต",
//     "วารสารศาสตรบัณฑิต สาขาวิชาสื่อศึกษา (ภาคภาษาอังกฤษ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชากายภาพบำบัด",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาการจัดการวิศวกรรม (หลักสูตรนานาชาติ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาการจัดการออกแบบ ธุรกิจ และเทคโนโลยี (หลักสูตรภาษาอังกฤษ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาการออกแบบเชิงนวัตกรรมดิจิทัล (หลักสูตรนานาชาติ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ วิชาเอกคณิตศาสตร์การเงิน(ภาคพิเศษ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ วิชาเอกวิทยาการจัดการเรียนรู้คณิตศาสตร์(ภาคพิเศษ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์การจัดการ(ภาคพิเศษ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาจิตวิทยา",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาทันตสาธารณสุข(หลักสูตรต่อเนื่อง)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปดิจิทัล",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อิเล็กทรอนิกส์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาภูมิศาสตร์และภูมิสารสนเทศ",
//     "วิทยาศาสตรบัณฑิต สาขาวิชารังสีเทคนิค",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวัสดุศาสตร์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการประกันภัย(ภาคพิเศษ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์การกีฬาและการออกกำลังกาย",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์อุตสาหการและการจัดการ(หลักสูตรนานาชาติ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และนวัตกรรมข้อมูล",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และนวัตกรรมทางอาหาร",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และเทคโนโลยีการอาหาร",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และเทคโนโลยีสิ่งทอ",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาสถาปัตยกรรม",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาสถาปัตยกรรมเพื่อการพัฒนาอสังหาริมทรัพย์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาสถิติ",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาสถิติ วิชาเอกวิทยาการวิเคราะห์ข้อมูล(ภาคพิเศษ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาสถิติ วิชาเอกสถิติประยุกต์(ภาคพิเศษ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาสาธารณสุขศาสตร์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาอนามัย สิ่งแวดล้อม",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาอนามัยชุมชน",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาอาชีวอนามัยและความปลอดภัย",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเคมี",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคนิคการแพทย์",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการจัดการ(หลักสูตรนานาชาติ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการเกษตร",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีชีวภาพ",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีดิจิทัลแนวสร้างสรรค์(หลักสูตรนานาชาติ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีทางคลินิก(หลักสูตรนานาชาติ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีพลังงานชีวภาพและการแปรรูปเคมีชีวภาพ",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ(หลักสูตรนานาชาติ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีหัวใจและทรวงอก(หลักสูตรนานาชาติ)",
//     "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเพื่อการพัฒนายั่งยืน",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์(หลักสูตรนานาชาติ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมซอฟต์แวร์",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมยานยนต์(หลักสูตรภาคภาษาอังกฤษ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอิเล็กทรอนิคส์และการสื่อสาร(หลักสูตรนานาชาติ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ(ภาคภาษาอังกฤษ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ(ภาคภาษาอังกฤษ)(สองสถาบัน)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ(หลักสูตรนานาชาติ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี(ภาคภาษาอังกฤษ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี(ภาคภาษาอังกฤษ)(สองสถาบัน)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี(หลักสูตรนานาชาติ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล(ภาคภาษาอังกฤษ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล(ภาคภาษาอังกฤษ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล(ภาคภาษาอังกฤษ)(สองสถาบัน)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล(หลักสูตรนานาชาติ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา(ภาคภาษาอังกฤษ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา(หลักสูตรนานาชาติ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและการบริหารการก่อสร้าง(ตรีควบโท)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า(ภาคภาษาอังกฤษ)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า(ภาคภาษาอังกฤษ)(สองสถาบัน)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าอุตสาหการ(ตรีควบโท)",
//     "วิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยียานยนต์(พัทยา)",
//     "ศิลปกรรมศาสตรบัณฑิต สาขาวิชาการละคอน",
//     "ศิลปกรรมศาสตรบัณฑิต สาขาวิชาศิลปะการออกแบบพัสตราภรณ์",
//     "ศิลปกรรมศาสตรบัณฑิต สาขาวิชาศิลปะการออกแบบหัตถอุตสาหกรรม",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาการจัดการกีฬา",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาการฝึกสอนกีฬา",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาการพัฒนาเชิงสร้างสรรค์",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาการสื่อสารภาษาอังกฤษเชิงธุรกิจ(หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาจีนศึกษา(หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ(หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชานโยบายสังคมและการพัฒนา(หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาบรรณารักษศาสตร์และสารสนเทศศาสตร์",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาประวัติศาสตร์",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาปรัชญา",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาปรัชญา การเมือง และเศรษฐศาสตร์(หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาปรัชญา การเมืองและเศรษฐศาสตร์",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาญี่ปุ่น",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาฝรั่งเศส",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษารัสเซีย",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาศาสตร์",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาอังกฤษ",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาเยอรมัน",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาและวรรณคดีอังกฤษ",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาและวัฒนธรรมจีน",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาไทย",
//     "ศิลปศาสตรบัณฑิต สาขาวิชารัสเซียศึกษา",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาวิทยาการเรียนรู้",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาวิเทศคดีศึกษา(อาเซียน - จีน)(หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาสหวิทยาการสังคมศาสตร์",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาอังกฤษ–อเมริกันศึกษา(หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาอินเดียศึกษา(หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาเอเชียตะวันออกเฉียงใต้ศึกษา",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาโลกคดีศึกษาและการประกอบการสังคม(ปริญญาตรี - หลักสูตรนานาชาติ)",
//     "ศิลปศาสตรบัณฑิต สาขาวิชาไทยศึกษา(หลักสูตรนานาชาติ)",
//     "สถาปัตยกรรมภายในบัณฑิต",
//     "สังคมวิทยาและมานุษยวิทยาบัณฑิต สาขาวิชาการวิจัยทางสังคม",
//     "สังคมวิทยาและมานุษยวิทยาบัณฑิต สาขาวิชาสังคมวิทยาและมานุษยวิทยา",
//     "สังคมสงเคราะห์ศาสตรบัณฑิต",
//     "เศรษฐศาสตรบัณฑิต",
//     "เศรษฐศาสตรบัณฑิต (หลักสูตรนานาชาติ)",
//     "แพทยศาสตรบัณฑิต",
//     "แพทยศาสตรบัณฑิต (หลักสูตรภาคภาษาอังกฤษ)",
// ];

const dorms = [
    { name: "rangsit" },
    { name: "thaprachan" },
    { name: "pattaya" },
    { name: "lampang" },
];

const rooms = [
    { roomId: "B-101", floor: 1, zone: "B", price: 5000 },
    { roomId: "C-201", floor: 2, zone: "C", price: 4000 },
    { roomId: "M1-201", floor: 2, zone: "M1", price: 900 },
    { roomId: "M2-201", floor: 2, zone: "M2", price: 1200 },
    { roomId: "F5-201", floor: 2, zone: "F5", price: 900 },
    { roomId: "F6-201", floor: 2, zone: "F6", price: 1200 },
    // { roomId: "201", floor: 2, zone: "B", price: 5500 },
    // { roomId: "202", floor: 2, zone: "B", price: 5500 },
];

// 2026-01-24 19:42:43

async function main() {
    // for (const name of faculties) {
    //     await prisma.faculty.create({ data: { name } });
    // }

    // insert dorms + rooms
    for (const dorm of dorms) {
        // ต้องสร้าง dorm ก่อน ถึงจะได้ id
        const createdDorm = await prisma.dorm.create({
            data: { name: dorm.name },
        });

        // แล้วใช้ dorm.id ที่ได้มา
        for (const room of rooms) {
            await prisma.room.create({
                data: {
                    roomId: room.roomId,
                    floor: room.floor,
                    zone: room.zone,
                    price: room.price,
                    available: true,
                    dormId: createdDorm.id, // ✅ ใช้ id จริง
                },
            });
        }

        console.log("✅ Inserted faculties && dorms && rooms");
    }
}

main()
    .catch((e) => console.error(e))
    .finally(async () => {
        await prisma.$disconnect();
    });
